/*Програма до завдання№5 
*/
#include <stdio.h>//Підключаємо необхідні для роботи бібліотеки
#include <math.h>

int main() {
    int x;//Оголошуємо змінні
    double result;

    printf("Введіть натуральне число x: ");//просимо юзера ввести натуральне число
    scanf_s("%d", &x);

    if (x <= 10) {//Перевірка коректності даних
        printf("Помилка: x має бути більшим за 10.\n");//Виводимо на екран юзера помилку
        return 1;
    }

    result = pow(x, 4) / (sqrt(x - 10) - pow(x, 2));//Обчислення відповідно до завдання

    printf("Результат: %.2f\n", result);//Виводимо відповідь на екран юзера

    return 0;//кінець програми
}